index.org
#+AUTHOR: Christian Graulund
#+TITLE: Homepage of Christian Graulund
#+CREATOR: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.2 (<a href="https://orgmode.org">Org</a> mode 9.1.9)
#+DESCRIPTION: The personal webpage of Christian Graulund
#+LANGUAGE: en
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:t
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:nil todo:t |:t
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+HTML_LINK_HOME: https://chgrau.github.io
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD_EXTRA:
#+INFOJS_OPT:
#+LATEX_HEADER:

I am a PhD student at ITU as part of the [[http:pls.itu.dk][Programming, Logic and
Semantics Group]]. I work on creating type systems for reactive
programming.

* Research
** Papers
   - P. Bahr, C. Graulund and R.E. Møgelberg: /Simply RaTT: A
     Fitch-style Modal Calculus for Reactive Programming/.
     Submitted 2019. [[http:arxiv.org/abs/1903.05876][arXiv]]
** Dissertations
   - C. Graulund: /Lambda Calculus for Reactive Programming/. Master
     Thesis, IT University of Copenhagen, 2018.
   - C. Graulund: /On Automata-Theoretic Characterizations of Regular
     Expressions as Types/. Bachelor Thesis, University of
     Copenhagen, 2015.
** Other
   - Addition to the [[https://github.com/UniMath/UniMath][UniMath]] library:
     [[https://github.com/UniMath/UniMath/pull/824][Categories from Preorders]],
     [[https://github.com/UniMath/UniMath/pull/840][Posets are Univalent]],
     [[https://github.com/UniMath/UniMath/pull/855][Functor Coalgebras]] and
     [[https://github.com/UniMath/UniMath/pull/1206][Non-wellfounded trees]].

* Contact
- Office 4C15, ITU
- Work e-mail: cgra@itu.dk
- Private e-mail: christiangraulund@gmail.com
