index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-04 Tue 16:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Homepage of Christian Graulund</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christian Graulund" />
<meta name="description" content="The personal webpage of Christian Graulund"
 />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://chgrau.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Homepage of Christian Graulund</h1>
<p>
I am a PhD student at ITU as part of the <a href="http:pls.itu.dk">Programming, Logic and
Semantics Group</a>. I work on creating type systems for reactive
programming.
</p>

<div id="outline-container-org874f494" class="outline-2">
<h2 id="org874f494"><span class="section-number-2">1</span> Research</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org070968b" class="outline-3">
<h3 id="org070968b"><span class="section-number-3">1.1</span> Papers</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>P. Bahr, C. Graulund and R.E. Møgelberg: <i>Simply RaTT: A
Fitch-style Modal Calculus for Reactive Programming</i>.
Submitted 2019. <a href="http:arxiv.org/abs/1903.05876">arXiv</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2f3f37e" class="outline-3">
<h3 id="org2f3f37e"><span class="section-number-3">1.2</span> Dissertations</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>C. Graulund: <i>Lambda Calculus for Reactive Programming</i>. Master
Thesis, IT University of Copenhagen, 2018.</li>
<li>C. Graulund: <i>On Automata-Theoretic Characterizations of Regular
Expressions as Types</i>. Bachelor Thesis, University of
Copenhagen, 2015.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf59148e" class="outline-3">
<h3 id="orgf59148e"><span class="section-number-3">1.3</span> Other</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Addition to the <a href="https://github.com/UniMath/UniMath">UniMath</a> library:
<a href="https://github.com/UniMath/UniMath/pull/824">Categories from Preorders</a>,
<a href="https://github.com/UniMath/UniMath/pull/840">Posets are Univalent</a>,
<a href="https://github.com/UniMath/UniMath/pull/855">Functor Coalgebras</a> and
<a href="https://github.com/UniMath/UniMath/pull/1206">Non-wellfounded trees</a>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Christian Graulund</p>
<p class="date">Created: 2019-06-04 Tue 16:02</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.2 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
